In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pt

In [2]:
file=pd.read_excel('insurance.csv.xlsx')

In [3]:
file.head()

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900       0.0    yes  southwest  16884.92400
1  18.0    male  33.770       1.0     no  southeast   1725.55230
2  28.0    male  33.000       3.0     no  southeast   4449.46200
3  33.0    male  22.705       0.0     no  northwest  21984.47061
4  32.0    male  28.880       0.0     no  northwest   3866.85520

In [4]:
file.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

# Measure of central tendency

In [5]:
file['age'].mean()

39.20702541106129

In [6]:
file['age'].median()

39.0

In [7]:
file['children'].mean()

1.0949177877429

In [8]:
file1=file.copy()
file2=file.copy()
file3=file.copy()
file4=file.copy()
file5=file.copy()
file6=file.copy()
file7=file.copy()
file8=file.copy()
file9=file.copy()
file10=file.copy()


# replace

In [9]:
file1.head()

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900       0.0    yes  southwest  16884.92400
1  18.0    male  33.770       1.0     no  southeast   1725.55230
2  28.0    male  33.000       3.0     no  southeast   4449.46200
3  33.0    male  22.705       0.0     no  northwest  21984.47061
4  32.0    male  28.880       0.0     no  northwest   3866.85520

In [10]:
file1.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [11]:
file.sex.unique()

array(['female', 'male'], dtype=object)

In [12]:
file.smoker.unique()

array(['yes', 'no'], dtype=object)

In [13]:
file.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [14]:
file1.sex=file1.sex.replace(['female','male'],[1,2])
file1.smoker=file1.smoker.replace(['yes', 'no'],[1,2])
file1.region=file1.region.replace(['southwest', 'southeast', 'northwest', 'northeast'],[1,2,3,4])

In [15]:
file1.head()

    age  sex     bmi  children  smoker  region      charges
0  19.0    1  27.900       0.0       1       1  16884.92400
1  18.0    2  33.770       1.0       2       2   1725.55230
2  28.0    2  33.000       3.0       2       2   4449.46200
3  33.0    2  22.705       0.0       2       3  21984.47061
4  32.0    2  28.880       0.0       2       3   3866.85520

# Label Encoding

In [16]:
from sklearn.preprocessing import LabelEncoder

In [17]:
from pandas.core.dtypes.common import is_numeric_dtype

In [18]:
le=LabelEncoder()

In [19]:
for col in file2.columns:
    if is_numeric_dtype(file2[col]):
        continue
    file2[col]=le.fit_transform(file2[col])

In [20]:
file2.head()

    age  sex     bmi  children  smoker  region      charges
0  19.0    0  27.900       0.0       1       3  16884.92400
1  18.0    1  33.770       1.0       0       2   1725.55230
2  28.0    1  33.000       3.0       0       2   4449.46200
3  33.0    1  22.705       0.0       0       1  21984.47061
4  32.0    1  28.880       0.0       0       1   3866.85520

# One Hot Encoding

In [21]:
file4.head()

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900       0.0    yes  southwest  16884.92400
1  18.0    male  33.770       1.0     no  southeast   1725.55230
2  28.0    male  33.000       3.0     no  southeast   4449.46200
3  33.0    male  22.705       0.0     no  northwest  21984.47061
4  32.0    male  28.880       0.0     no  northwest   3866.85520

In [22]:
columns = ['sex','smoker','region']      

for col in columns:
    one_hot = pd.get_dummies(file4[col],drop_first=True, prefix= col)   
    file4= pd.concat([file4, one_hot], axis=1).drop(col,axis=1)

In [23]:
file4.head()

,age,bmi,children,charges,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19.0,27.900,0.0,16884.92400,0,1,0,0,1
1,18.0,33.770,1.0,1725.55230,1,0,0,1,0
2,28.0,33.000,3.0,4449.46200,1,0,0,1,0
3,33.0,22.705,0.0,21984.47061,1,0,1,0,0
4,32.0,28.880,0.0,3866.85520,1,0,1,0,0

In [24]:
#same thing in another process
file5.head()

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900       0.0    yes  southwest  16884.92400
1  18.0    male  33.770       1.0     no  southeast   1725.55230
2  28.0    male  33.000       3.0     no  southeast   4449.46200
3  33.0    male  22.705       0.0     no  northwest  21984.47061
4  32.0    male  28.880       0.0     no  northwest   3866.85520

In [25]:
for col in file5.columns:
    if is_numeric_dtype(file5[col]):
        continue
    one_hot = pd.get_dummies(file5[col],drop_first=True, prefix= col)   
    file5= pd.concat([file5, one_hot], axis=1).drop(col,axis=1)

In [26]:
file5.head()

,age,bmi,children,charges,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19.0,27.900,0.0,16884.92400,0,1,0,0,1
1,18.0,33.770,1.0,1725.55230,1,0,0,1,0
2,28.0,33.000,3.0,4449.46200,1,0,0,1,0
3,33.0,22.705,0.0,21984.47061,1,0,1,0,0
4,32.0,28.880,0.0,3866.85520,1,0,1,0,0

# Ordinal Encoding

In [27]:
from sklearn.preprocessing import OrdinalEncoder

In [28]:
gender = file7.sex.unique()

In [29]:
ordi = OrdinalEncoder(categories=[gender])

In [30]:
encoded_values = ordi.fit_transform(file7[['sex']])

In [31]:
file7['sex'] = pd.DataFrame(encoded_values)

In [32]:
file7.head()

    age  sex     bmi  children smoker     region      charges
0  19.0  0.0  27.900       0.0    yes  southwest  16884.92400
1  18.0  1.0  33.770       1.0     no  southeast   1725.55230
2  28.0  1.0  33.000       3.0     no  southeast   4449.46200
3  33.0  1.0  22.705       0.0     no  northwest  21984.47061
4  32.0  1.0  28.880       0.0     no  northwest   3866.85520

In [33]:
area=file7.region.unique()

In [34]:
ordi1 = OrdinalEncoder(categories=[area])

In [35]:
encoded_values1 = ordi1.fit_transform(file7[['region']])

In [44]:
file7['region'] = pd.DataFrame(encoded_values1)

In [45]:
file7.head()

    age  sex     bmi  children smoker  region      charges
0  19.0  0.0  27.900       0.0    yes     0.0  16884.92400
1  18.0  1.0  33.770       1.0     no     1.0   1725.55230
2  28.0  1.0  33.000       3.0     no     1.0   4449.46200
3  33.0  1.0  22.705       0.0     no     2.0  21984.47061
4  32.0  1.0  28.880       0.0     no     2.0   3866.85520

In [41]:
smk=file7.smoker.unique()

In [42]:
ordi2 = OrdinalEncoder(categories=[smk])

In [43]:
encoded_values2 = ordi2.fit_transform(file7[['smoker']])

In [46]:
file7['smoker'] = pd.DataFrame(encoded_values2)

In [47]:
file7.head()

    age  sex     bmi  children  smoker  region      charges
0  19.0  0.0  27.900       0.0     0.0     0.0  16884.92400
1  18.0  1.0  33.770       1.0     1.0     1.0   1725.55230
2  28.0  1.0  33.000       3.0     1.0     1.0   4449.46200
3  33.0  1.0  22.705       0.0     1.0     2.0  21984.47061
4  32.0  1.0  28.880       0.0     1.0     2.0   3866.85520